package base;

/**
 * =================================================================================================
 * 日期		             开发者	       修改类型  	      备注
 * 2019/2/19			 Hearts         创建	          描述：请输入描述
 * =================================================================================================
 * Copyright (c) 2018-2020 湖南创博龙智信息科技股份有限公司 All rights reserved.
 * =================================================================================================
 */
public interface Operation<IN,OUT> {

    /**
     * 判断该运算的数据是否合法
     * @return
     */
    public boolean checkData(IN data);

    /**
     * 具体执行过程
     * @return
     */
    public OUT operationStep(IN data);

    /**
     * 执行运算
     */
    public OUT execOpration(IN data);
}
